# Напишите функцию с именем times ten.
# Эта функция должна принимать аргумент и показывать результат произведения аргумента на 1О.


def times_ten(num):
    print(num * 10)

    
times_ten(2)