# Напишите цикл for, который выводит приведенный ниже ряд чисел:
# О, 10, 20, 30, 40, 50, ... , 1000

for i in range(0, 1001, 10):
    print(i)
