# Класс персональных данных Infoпnation. Разработайте класс, который содержит
# следующие персональные данные: имя, адрес, возраст и телефонный номер. Напишите
# соответствующие методы-получатели и методы-модификаторы. Кроме того, напишите
# программу, которая создает три экземпляра класса. Один экземпляр должен содержать
# информацию о вас, а два других - информацию о ваших друзьях или членах семьи.

from lesson06HW.task06.information import Information

user1 = Information('name1', 'address1', 'age1', 'phone1')
user2 = Information('name2', 'address2', 'age2', 'phone2')
user3 = Information('name3', 'address3', 'age3', 'phone3')
