# Напишите функцию, которая принимает строковое значение в качестве аргумента
# и показывает строковое значение в обратном порядке.

def get_reverse(string):
    return string[::-1]


print(get_reverse('Напишите функцию, которая принимает строковое значение в качестве аргумента'))
