# Напишите фрагмент кода, делающий копию строкового значения, в котором все вхождения буквы 'т'
# в нижнем регистре преобразованы в верхний регистр.


string = 'Напишите цикл, который подсчитывает 123 количество пробельных символов в строковом значении'

new_string = string.replace('т', 'Т')

print(new_string)