# Напишите инструкцию, которая создает пустой словарь.

a = dict()

print(a)